a = {
    "title": {"text": "热门专业top10"},
    "xAxis": {
        "name": "专业",
        "data": ["工商管理", "计算机", "金融学", "法学", "经济学", "教育学", "化学", "电子信息", "电气工程及其自动化", "马克思主义", "汉语", "机械类", "自动化", "管理科学与工程", "建筑学", "基础医学", "机械设计制造及其自动化", "统计学", "设计学", "公共管理", "新闻传播", "材料类", "生物科学", "数学类", "经济与贸易", "土木类", "物理学", "药学", "临床医学", "外国文学", "环境科学"],
        axisLabel: {
            interval: 0
        }
    },
    "yAxis": {"name": "热度"},
    "series": [{
        "data": [86, 46, 37, 36, 33, 30, 30, 30, 27, 27, 26, 26, 23, 23, 22, 22, 21, 20, 20, 19, 19, 18, 17, 17, 17, 16, 16, 15, 15, 15, 14],
        "type": "bar"
    }],
    "dataZoom": [{"show": true, "realtime": true, "start": 0, "end": 50}, {
        "type": "inside",
        "realtime": true,
        "start": 0,
        "end": 50
    }]
};